Enums/ВариантДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВариантДоступа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запретить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрешить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантДоступа/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
		
	ДанныеВыбора = Новый СписокЗначений;     
	ДанныеВыбора.Добавить(Перечисления.ВариантДоступа.Запретить, Перечисления.ВариантДоступа.Запретить, , БиблиотекаКартинок.ОформлениеЗнакКрест);
	ДанныеВыбора.Добавить(Перечисления.ВариантДоступа.Разрешить, Перечисления.ВариантДоступа.Разрешить, , БиблиотекаКартинок.ОформлениеЗнакФлажок);
	
КонецПроцедуры
